export default {
  projections: {
    ЗаказE: {
      дата: {
        __caption__: 'Дата'
      },
      номерЗаказа: {
        __caption__: 'Номер заказа'
      },
      контрагент: {
        __caption__: 'Контрагент',
        контрагент: {
          __caption__: 'Контрагент'
        }
      },
      мастер: {
        __caption__: 'Мастер',
        фИО: {
          __caption__: 'Мастер'
        }
      },
      итог: {
        __caption__: 'Итог'
      },
      расчетЗаказа: {
        __caption__: 'Расчет заказа',
        номенклатура: {
          __caption__: 'Товар',
          товар: {
            __caption__: 'Товар'
          },
          цена: {
            __caption__: 'Цена'
          }
        },
        количество: {
          __caption__: 'Количество'
        },
        сумма: {
          __caption__: 'Сумма'
        }
      }
    },
    ЗаказL: {
      дата: {
        __caption__: 'Дата'
      },
      номерЗаказа: {
        __caption__: 'Номер заказа'
      },
      контрагент: {
        __caption__: 'Контрагент',
        контрагент: {
          __caption__: 'Контрагент'
        }
      },
      мастер: {
        __caption__: 'Мастер',
        фИО: {
          __caption__: 'Мастер'
        }
      },
      итог: {
        __caption__: 'Итог'
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    итог: {
      __caption__: 'Итог'
    },
    номерЗаказа: {
      __caption__: 'Номер заказа'
    },
    контрагент: {
      __caption__: 'Контрагент'
    },
    мастер: {
      __caption__: 'Мастер'
    },
    расчетЗаказа: {
      __caption__: 'Расчет заказа'
    }
  }
};
